mlnn3014/GD32F470VE_Keil_Project-template/BootLoader/Protocol/Src/bootloader_app.c
#include "bootloader_app.h"

#include <string.h>

#include "bl_param.h"
#include "boot_rs485_bsp.h"
#include "gd32f4xx.h"
#include "oled.h"
#include "onchip_flash_bsp.h"
#include "systick.h"
#include "upgrade_flag.h"

#define BOOT_RX_ASCII_MAX  256U
#define BOOT_RX_BYTES_MAX  128U
#define BOOT_CONTENT_MAX   64U
#define BOOT_RAW_BLOCK     256U
#define BOOT_READ_TIMEOUT  5000U
#define BOOT_RAW_START_MS  1500U
#define BOOT_RAW_NEXT_MS   500U
#define BOOT_RAW_BYTE_MS   100U
#define BOOT_WAIT_APP_MS   5000U
#define BOOT_WAIT_UP_MS    10000U

#define MSG_HEAD_H         0xA5
#define MSG_HEAD_L         0xB6
#define MSG_TAIL_H         0xB6
#define MSG_TAIL_L         0xA5
#define MSG_VERSION        0x02
#define MSG_TYPE_CMD       0x01
#define MSG_TYPE_RSP       0x02
#define MSG_TYPE_ERROR     0xFF

#define BOOT_COPY_BUF_SIZE 256U
#define BOOT_MAGIC_0       0x5A
#define BOOT_MAGIC_1       0xA5
#define BOOT_MAGIC_2       0xC3
#define BOOT_MAGIC_3       0x3C

typedef struct
{
    uint16_t id;
    uint8_t type;
    uint16_t cmd;
    uint8_t len;
    uint8_t version;
    uint8_t *content;
    uint16_t crc;
} boot_msg_t;

typedef void (*app_entry_t)(void);

static uint8_t boot_rx_ascii[BOOT_RX_ASCII_MAX];
static uint8_t boot_rx_bytes[BOOT_RX_BYTES_MAX];
static uint8_t boot_raw_buf[BOOT_RAW_BLOCK];
static uint8_t copy_buf[BOOT_COPY_BUF_SIZE];

static uint32_t boot_recv_size;
static uint32_t boot_app_size;
static uint32_t boot_app_crc;
static uint32_t boot_crc_calc;
static uint32_t boot_erased_size;
static uint32_t boot_package_recv_size;

static uint32_t boot_get_u32_le(const uint8_t *data)
{
    return ((uint32_t)data[0]) |
           ((uint32_t)data[1] << 8) |
           ((uint32_t)data[2] << 16) |
           ((uint32_t)data[3] << 24);
}

static uint32_t boot_baud_from_code(uint32_t code)
{
    switch (code)
    {
    case 0x11:
        return 4800UL;

    case 0x12:
        return 9600UL;

    case 0x13:
        return 19200UL;

    case 0x14:
    default:
        return 115200UL;
    }
}

static uint16_t boot_get_u16(const uint8_t *data)
{
    return (uint16_t)(((uint16_t)data[0] << 8) | data[1]);
}

static uint8_t boot_magic_is_ok(const uint8_t *data)
{
    // 官方 bin 就是按这个字节顺序放魔术字
    return (uint8_t)((data[0] == BOOT_MAGIC_0) &&
                     (data[1] == BOOT_MAGIC_1) &&
                     (data[2] == BOOT_MAGIC_2) &&
                     (data[3] == BOOT_MAGIC_3));
}

static int8_t boot_hex_value(char ch)
{
    if ((ch >= '0') && (ch <= '9'))
        return (int8_t)(ch - '0');
    if ((ch >= 'A') && (ch <= 'F'))
        return (int8_t)(ch - 'A' + 10);

    return -1;
}

static uint16_t boot_crc16(const uint8_t *data, uint16_t len)
{
    uint16_t crc = 0xFFFF;

    for (uint16_t i = 0; i < len; i++)
    {
        crc ^= data[i];
        for (uint8_t j = 0; j < 8; j++)
        {
            if ((crc & 0x0001) != 0)
                crc = (uint16_t)((crc >> 1) ^ 0xA001);
            else
                crc >>= 1;
        }
    }

    return crc;
}

static uint32_t boot_crc32_update(uint32_t crc, const uint8_t *data, uint32_t len)
{
    for (uint32_t i = 0; i < len; i++)
    {
        crc ^= data[i];
        for (uint32_t bit = 0; bit < 8UL; bit++)
        {
            if ((crc & 1UL) != 0UL)
                crc = (crc >> 1UL) ^ 0xEDB88320UL;
            else
                crc >>= 1UL;
        }
    }

    return crc;
}

static void boot_send_msg(uint16_t id, uint8_t type, uint16_t cmd, const uint8_t *content, uint8_t len)
{
    static const char hex[] = "0123456789ABCDEF";
    uint8_t raw[BOOT_CONTENT_MAX + 13U];
    char ascii[(BOOT_CONTENT_MAX + 13U) * 2U];
    uint16_t raw_len = 0;
    uint16_t crc;

    raw[raw_len++] = MSG_HEAD_H;
    raw[raw_len++] = MSG_HEAD_L;
    raw[raw_len++] = (uint8_t)(id >> 8);
    raw[raw_len++] = (uint8_t)id;
    raw[raw_len++] = type;
    raw[raw_len++] = (uint8_t)(cmd >> 8);
    raw[raw_len++] = (uint8_t)cmd;
    raw[raw_len++] = len;
    raw[raw_len++] = MSG_VERSION;

    for (uint8_t i = 0; i < len; i++)
        raw[raw_len++] = content[i];

    crc = boot_crc16(raw, raw_len);
    raw[raw_len++] = (uint8_t)(crc >> 8);
    raw[raw_len++] = (uint8_t)crc;
    raw[raw_len++] = MSG_TAIL_H;
    raw[raw_len++] = MSG_TAIL_L;

    for (uint16_t i = 0; i < raw_len; i++)
    {
        ascii[i * 2U] = hex[raw[i] >> 4];
        ascii[(i * 2U) + 1U] = hex[raw[i] & 0x0F];
    }

    boot_rs485_write((const uint8_t *)ascii, raw_len * 2U);
}

static void boot_send_ok(uint16_t id, uint16_t cmd)
{
    uint8_t ok = 0xFF;

    boot_send_msg(id, MSG_TYPE_RSP, cmd, &ok, 1);
}

static void boot_send_error(uint16_t id)
{
    boot_send_msg(id, MSG_TYPE_ERROR, 0xEEEE, 0, 0);
}

static void boot_send_cmd_error(uint16_t id, uint16_t cmd)
{
    boot_send_msg(id, MSG_TYPE_ERROR, cmd, 0, 0);
}

static uint8_t boot_ascii_to_bytes(const uint8_t *ascii, uint16_t ascii_len, uint8_t *bytes, uint16_t *bytes_len)
{
    uint16_t len = 0;

    if ((ascii_len & 1U) != 0)
        return 0;

    for (uint16_t i = 0; i < ascii_len; i += 2U)
    {
        int8_t high = boot_hex_value((char)ascii[i]);
        int8_t low = boot_hex_value((char)ascii[i + 1U]);

        if ((high < 0) || (low < 0) || (len >= BOOT_RX_BYTES_MAX))
            return 0;

        bytes[len++] = (uint8_t)((high << 4) | low);
    }

    *bytes_len = len;
    return 1;
}

static uint8_t boot_parse_msg(uint8_t *bytes, uint16_t len, boot_msg_t *msg)
{
    uint16_t total_len;

    if ((bytes == 0) || (msg == 0) || (len < 13U))
        return 0;

    if ((bytes[0] != MSG_HEAD_H) || (bytes[1] != MSG_HEAD_L))
        return 0;

    msg->id = boot_get_u16(&bytes[2]);
    msg->type = bytes[4];
    msg->cmd = boot_get_u16(&bytes[5]);
    msg->len = bytes[7];
    msg->version = bytes[8];

    total_len = (uint16_t)(13U + msg->len);
    if (len != total_len)
        return 0;

    if ((bytes[len - 2U] != MSG_TAIL_H) || (bytes[len - 1U] != MSG_TAIL_L))
        return 0;

    msg->content = &bytes[9];
    msg->crc = boot_get_u16(&bytes[9U + msg->len]);

    if (msg->crc != boot_crc16(bytes, (uint16_t)(9U + msg->len)))
        return 0;

    return 1;
}

static uint8_t boot_read_msg_timeout(boot_msg_t *msg, uint32_t timeout_ms)
{
    uint16_t ascii_len = 0;
    uint16_t total_ascii_len = 0;
    uint16_t bytes_len = 0;
    uint8_t data;

    while (1)
    {
        if (boot_rs485_read_byte(&data, timeout_ms) == 0)
            return 0;

        if (boot_hex_value((char)data) < 0)
        {
            ascii_len = 0;
            total_ascii_len = 0;
            continue;
        }

        if (ascii_len >= BOOT_RX_ASCII_MAX)
        {
            ascii_len = 0;
            total_ascii_len = 0;
            continue;
        }

        if ((ascii_len == 0) && (data != 'A'))
            continue;

        boot_rx_ascii[ascii_len++] = data;

        if ((ascii_len == 2U) && (boot_rx_ascii[1] != '5'))
        {
            ascii_len = 0;
            total_ascii_len = 0;
            continue;
        }

        if ((ascii_len == 4U) &&
            ((boot_rx_ascii[2] != 'B') || (boot_rx_ascii[3] != '6')))
        {
            ascii_len = 0;
            total_ascii_len = 0;
            continue;
        }

        if (ascii_len == 16U)
        {
            int8_t high = boot_hex_value((char)boot_rx_ascii[14]);
            int8_t low = boot_hex_value((char)boot_rx_ascii[15]);
            uint8_t content_len;

            if ((high < 0) || (low < 0))
                return 0;

            content_len = (uint8_t)((high << 4) | low);
            total_ascii_len = (uint16_t)((13U + content_len) * 2U);
            if (total_ascii_len > BOOT_RX_ASCII_MAX)
                return 0;
        }

        if ((total_ascii_len != 0U) && (ascii_len >= total_ascii_len))
        {
            if (boot_ascii_to_bytes(boot_rx_ascii, ascii_len, boot_rx_bytes, &bytes_len) == 0)
                return 0;

            return boot_parse_msg(boot_rx_bytes, bytes_len, msg);
        }
    }
}

static uint8_t boot_app_vector_ok(uint32_t app_base)
{
    uint32_t msp = *(volatile uint32_t *)app_base;
    uint32_t reset = *(volatile uint32_t *)(app_base + 4UL);

    if ((msp < 0x20000000UL) || (msp > 0x20030000UL))
        return 0;

    if ((reset < BL_APP1_START_ADDR) || (reset > BL_APP1_END_ADDR))
        return 0;

    return 1;
}

static uint32_t boot_crc32_flash(uint32_t addr, uint32_t size)
{
    return bl_crc32_calc((const uint8_t *)addr, size);
}

static uint8_t boot_erase_area_need(uint32_t base_addr, uint32_t *erased_size, uint32_t write_addr, uint32_t len)
{
    uint32_t need_size;
    uint32_t erase_addr;

    if ((erased_size == 0) || (len == 0UL))
        return 1;

    need_size = (write_addr - base_addr) + len;
    while (*erased_size < need_size)
    {
        erase_addr = base_addr + *erased_size;
        if (onchip_flash_erase(erase_addr, BL_FLASH_PAGE_SIZE) == 0)
            return 0;

        *erased_size += BL_FLASH_PAGE_SIZE;
    }

    return 1;
}

static uint8_t boot_write_area(uint32_t base_addr, uint32_t *erased_size, uint32_t offset,
                               const uint8_t *data, uint32_t len)
{
    uint32_t write_addr = base_addr + offset;

    if ((data == 0) || (len == 0UL))
        return 1;

    if (boot_erase_area_need(base_addr, erased_size, write_addr, len) == 0)
        return 0;

    return onchip_flash_write(write_addr, data, len);
}

static uint8_t boot_read_raw_block(uint32_t first_timeout_ms, uint32_t *read_len)
{
    uint8_t data;
    uint32_t len = 0;

    if (read_len == 0)
        return 0;

    if (boot_rs485_read_byte(&data, first_timeout_ms) == 0)
    {
        *read_len = 0;
        return 1;
    }

    boot_raw_buf[len++] = data;

    while (len < BOOT_RAW_BLOCK)
    {
        if (boot_rs485_read_byte(&data, BOOT_RAW_BYTE_MS) == 0)
            break;

        boot_raw_buf[len++] = data;
    }

    *read_len = len;
    return 1;
}

static uint8_t boot_handle_raw_block(uint32_t read_len)
{
    if (read_len == 0UL)
        return 1;

    boot_package_recv_size += read_len;

    if (boot_recv_size == 0UL)
    {
        if (read_len < 4UL)
            return 0;

        if (boot_magic_is_ok(&boot_raw_buf[0]) == 0)
            return 0;

        boot_app_size = 0;
        boot_app_crc = 0;
        boot_crc_calc = 0xFFFFFFFFUL;
        boot_erased_size = 0;
    }

    if ((boot_recv_size + read_len) > BL_TEMP_SIZE)
        return 0;

    if (boot_write_area(BL_TEMP_START_ADDR, &boot_erased_size, boot_recv_size, boot_raw_buf, read_len) == 0)
        return 0;

    if (boot_recv_size == 0UL)
    {
        boot_crc_calc = boot_crc32_update(boot_crc_calc, &boot_raw_buf[4], read_len - 4UL);
        boot_app_size += read_len - 4UL;
    }
    else
    {
        boot_crc_calc = boot_crc32_update(boot_crc_calc, boot_raw_buf, read_len);
        boot_app_size += read_len;
    }

    boot_recv_size += read_len;

    return 1;
}

static uint8_t boot_receive_firmware(void)
{
    uint32_t read_len;
    uint32_t first_timeout = BOOT_RAW_START_MS;
    uint8_t image_bad = 0;

    // 0502 后面就是裸 bin, 收到断流就算结束
    while (1)
    {
        if (boot_read_raw_block(first_timeout, &read_len) == 0)
            return 0;

        if (read_len == 0UL)
            break;

        if (image_bad == 0)
        {
            if (boot_handle_raw_block(read_len) == 0)
                image_bad = 1;
        }

        first_timeout = BOOT_RAW_NEXT_MS;
    }

    if (image_bad != 0)
        return 0;

    if ((boot_app_size == 0UL) || (boot_recv_size != (boot_app_size + 4UL)))
        return 0;

    boot_app_crc = boot_crc_calc ^ 0xFFFFFFFFUL;

    if (boot_app_vector_ok(BL_TEMP_START_ADDR + 4UL) == 0)
        return 0;

    return 1;
}

static uint8_t boot_copy_flash_region(uint32_t dst_addr, uint32_t dst_size,
                                      uint32_t src_addr, uint32_t src_size,
                                      uint32_t copy_size)
{
    uint32_t copied = 0;
    uint32_t left;
    uint32_t chunk;
    uint32_t erased_size = 0;

    if ((copy_size == 0UL) || (copy_size > dst_size) || (copy_size > src_size))
        return 0;

    while (copied < copy_size)
    {
        left = copy_size - copied;
        chunk = (left > BOOT_COPY_BUF_SIZE) ? BOOT_COPY_BUF_SIZE : left;

        memcpy(copy_buf, (const void *)(src_addr + copied), chunk);
        if (boot_write_area(dst_addr, &erased_size, copied, copy_buf, chunk) == 0)
            return 0;

        copied += chunk;
    }

    return 1;
}

static uint8_t boot_backup_app1(void)
{
    return boot_copy_flash_region(BL_APP2_START_ADDR, BL_APP2_SIZE,
                                  BL_APP1_START_ADDR, BL_APP1_SIZE,
                                  BL_APP1_SIZE);
}

static uint8_t boot_restore_app1(void)
{
    return boot_copy_flash_region(BL_APP1_START_ADDR, BL_APP1_SIZE,
                                  BL_APP2_START_ADDR, BL_APP2_SIZE,
                                  BL_APP1_SIZE);
}

static uint8_t boot_copy_temp_to_app1(uint32_t app_size)
{
    return boot_copy_flash_region(BL_APP1_START_ADDR, BL_APP1_SIZE,
                                  BL_TEMP_START_ADDR + 4UL, BL_TEMP_SIZE - 4UL,
                                  app_size);
}

static uint8_t boot_commit_update(void)
{
    bl_param_t param;

    (void)onchip_flash_read_param(&param);

    param.update_flag = BL_UPDATE_FLAG_PENDING;
    param.app_size = boot_app_size;
    param.app_crc32 = boot_app_crc;
    param.app1_addr = BL_APP1_START_ADDR;
    param.app2_addr = BL_APP2_START_ADDR;
    param.last_error = BL_ERR_NONE;

    return onchip_flash_commit_param(&param);
}

static void boot_clear_update_flag(bl_param_t *param, uint32_t flag, uint32_t error)
{
    param->update_flag = flag;
    param->last_error = error;

    if (flag == BL_UPDATE_FLAG_IDLE)
        param->update_counter++;
    else
        param->fail_counter++;

    (void)onchip_flash_commit_param(param);
}

static void boot_oled_show(void)
{
    // Boot 区只显示题目要求的两行
    if (oled_init() != OLED_OK)
        return;

    (void)oled_text_printf(OLED_FONT_8, 0, 0, 0, "2026141323");
    (void)oled_text_printf(OLED_FONT_8, 1, 0, 0, "Bootloader");
    (void)oled_update();
}

static void boot_jump_app(uint32_t app_base)
{
    uint32_t reset_handler;
    app_entry_t app_entry;

    __disable_irq();

    SysTick->CTRL = 0UL;
    SysTick->LOAD = 0UL;
    SysTick->VAL = 0UL;

    for (uint32_t i = 0; i < 8UL; i++)
    {
        NVIC->ICER[i] = 0xFFFFFFFFUL;
        NVIC->ICPR[i] = 0xFFFFFFFFUL;
    }

    __DSB();
    __ISB();

    SCB->VTOR = app_base;
    __set_MSP(*(volatile uint32_t *)app_base);

    reset_handler = *(volatile uint32_t *)(app_base + 4UL);
    app_entry = (app_entry_t)reset_handler;
    __enable_irq();
    app_entry();
}

static void boot_handle_update(bl_param_t *param)
{
    uint32_t crc;
    uint8_t update_ok = 1;
    uint8_t backup_ok = 0;

    if ((param->app_size == 0UL) ||
        (param->app_size > BL_APP1_SIZE) ||
        (param->app_size > (BL_TEMP_SIZE - 4UL)) ||
        (boot_app_vector_ok(BL_TEMP_START_ADDR + 4UL) == 0))
    {
        boot_clear_update_flag(param, BL_UPDATE_FLAG_FAILED, BL_ERR_APP2_INVALID);
        return;
    }

    crc = boot_crc32_flash(BL_TEMP_START_ADDR + 4UL, param->app_size);
    if (crc != param->app_crc32)
    {
        boot_clear_update_flag(param, BL_UPDATE_FLAG_FAILED, BL_ERR_APP2_INVALID);
        return;
    }

    if (boot_app_vector_ok(BL_APP1_START_ADDR) != 0)
    {
        backup_ok = boot_backup_app1();
        if (backup_ok == 0)
            update_ok = 0;
    }

    if ((update_ok != 0) && (boot_copy_temp_to_app1(param->app_size) == 0))
        update_ok = 0;

    if (update_ok == 0)
    {
        if (backup_ok != 0)
            (void)boot_restore_app1();

        boot_clear_update_flag(param, BL_UPDATE_FLAG_FAILED, BL_ERR_COPY_FAILED);
        return;
    }

    crc = boot_crc32_flash(BL_APP1_START_ADDR, param->app_size);
    if (crc != param->app_crc32)
    {
        if (backup_ok != 0)
            (void)boot_restore_app1();

        boot_clear_update_flag(param, BL_UPDATE_FLAG_FAILED, BL_ERR_COPY_FAILED);
        return;
    }

    boot_clear_update_flag(param, BL_UPDATE_FLAG_IDLE, BL_ERR_NONE);
}

static void boot_wait_print_start(void)
{
    // 这些字符串题目说要直接打出来
    boot_rs485_write((const uint8_t *)"using command to interrupt start Application\r\n", 46);
    boot_rs485_write((const uint8_t *)"wait for start Application(10s)......\r\n", 39);
}

static void boot_wait_print_tick(uint32_t elapsed_ms, uint8_t *step)
{
    // 按题目写的 10/7/4/1 秒节奏打
    if ((*step == 0) && (elapsed_ms >= 3000UL))
    {
        boot_rs485_write((const uint8_t *)"wait for start Application(7s)......\r\n", 38);
        *step = 1;
    }

    if ((*step == 1) && (elapsed_ms >= 6000UL))
    {
        boot_rs485_write((const uint8_t *)"wait for start Application(4s)......\r\n", 38);
        *step = 2;
    }

    if ((*step == 2) && (elapsed_ms >= 9000UL))
    {
        boot_rs485_write((const uint8_t *)"wait for start Application(1s)......\r\n", 38);
        *step = 3;
    }
}

static void boot_upgrade_mode(uint16_t id, uint32_t baudrate)
{
    boot_msg_t msg;
    uint32_t wait_start;
    uint32_t elapsed;
    uint8_t started = 0;
    uint8_t print_step = 0;

    boot_recv_size = 0;
    boot_app_size = 0;
    boot_app_crc = 0;
    boot_crc_calc = 0xFFFFFFFFUL;
    boot_erased_size = 0;
    boot_package_recv_size = 0;

    boot_rs485_init(baudrate);
    boot_wait_print_start();
    wait_start = systick_get_ms();

    while (1)
    {
        elapsed = (uint32_t)(systick_get_ms() - wait_start);
        if (started == 0)
            boot_wait_print_tick(elapsed, &print_step);

        if ((started == 0) && (elapsed >= BOOT_WAIT_UP_MS))
        {
            if (boot_app_vector_ok(BL_APP1_START_ADDR) != 0)
                boot_jump_app(BL_APP1_START_ADDR);
        }

        if (boot_read_msg_timeout(&msg, 200U) == 0)
            continue;

        if ((msg.id != id) && (msg.id != 0xFFFF))
            continue;

        if ((msg.type != MSG_TYPE_CMD) || (msg.version != MSG_VERSION))
        {
            boot_send_error(id);
            continue;
        }

        switch (msg.cmd)
        {
        case 0x0502:
            if (msg.len != 0)
            {
                boot_send_cmd_error(id, msg.cmd);
                break;
            }

            started = 1;
            boot_recv_size = 0;
            boot_app_size = 0;
            boot_app_crc = 0;
            boot_crc_calc = 0xFFFFFFFFUL;
            boot_erased_size = 0;
            boot_package_recv_size = 0;

            if (boot_receive_firmware() == 0)
            {
                boot_send_cmd_error(id, msg.cmd);
                break;
            }

            boot_send_ok(id, msg.cmd);
            break;

        case 0x0503:
            if (msg.len != 0)
            {
                boot_send_cmd_error(id, msg.cmd);
                break;
            }

            if ((boot_app_size == 0UL) ||
                (boot_recv_size != (boot_app_size + 4UL)) ||
                (boot_crc32_flash(BL_TEMP_START_ADDR + 4UL, boot_app_size) != boot_app_crc))
            {
                boot_send_cmd_error(id, msg.cmd);
                break;
            }

            if (boot_commit_update() == 0)
            {
                boot_send_cmd_error(id, msg.cmd);
                break;
            }

            boot_send_ok(id, msg.cmd);
            delay_1ms(120);
            NVIC_SystemReset();
            break;

        default:
            boot_send_error(id);
            break;
        }
    }
}

void bootloader_run(void)
{
    bl_param_t param;
    uint16_t upgrade_id;
    uint32_t upgrade_baud;

    boot_oled_show();

    if (onchip_flash_read_param(&param) == 0)
        (void)onchip_flash_commit_param(&param);

    if (RTC_BKP2 == UPGRADE_FLAG_MAGIC)
    {
        upgrade_id = (uint16_t)RTC_BKP3;
        if ((upgrade_id == 0x0000) || (upgrade_id == 0xFFFF))
        {
            if ((param.comm_device_id != 0UL) && (param.comm_device_id < 0xFFFFUL))
                upgrade_id = (uint16_t)param.comm_device_id;
            else
                upgrade_id = UPGRADE_DEFAULT_ID;
        }

        upgrade_baud = boot_baud_from_code(param.comm_baud_code);

        rcu_periph_clock_enable(RCU_PMU);
        pmu_backup_write_enable();
        RTC_BKP2 = 0;
        boot_upgrade_mode(upgrade_id, upgrade_baud);
    }

    if (param.update_flag == BL_UPDATE_FLAG_PENDING)
    {
        boot_handle_update(&param);
        NVIC_SystemReset();
    }

    // 没升级请求就安静等 5 秒, 然后跳 APP
    delay_1ms(BOOT_WAIT_APP_MS);

    if (boot_app_vector_ok(BL_APP1_START_ADDR) != 0)
        boot_jump_app(BL_APP1_START_ADDR);

    param.last_error = BL_ERR_APP1_INVALID;
    (void)onchip_flash_commit_param(&param);

    while (1)
    {
    }
}
